perf-tests/reports/stress-160vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf-tests/k6/scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 160 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 160 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 160 VUs  00.7s/30s

running (0m02.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 160 VUs  01.7s/30s

running (0m03.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 160 VUs  02.7s/30s

running (0m04.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 160 VUs  03.7s/30s

running (0m05.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 160 VUs  04.7s/30s

running (0m06.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  19% ] 160 VUs  05.7s/30s

running (0m07.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  22% ] 160 VUs  06.7s/30s

running (0m08.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 160 VUs  07.7s/30s

running (0m09.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  29% ] 160 VUs  08.7s/30s

running (0m10.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  32% ] 160 VUs  09.7s/30s

running (0m11.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  36% ] 160 VUs  10.7s/30s

running (0m12.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  39% ] 160 VUs  11.7s/30s

running (0m13.0s), 160/160 VUs, 0 complete and 0 interrupted iterations
default   [  42% ] 160 VUs  12.7s/30s

running (0m14.0s), 160/160 VUs, 1 complete and 0 interrupted iterations
default   [  46% ] 160 VUs  13.7s/30s

running (0m15.0s), 160/160 VUs, 13 complete and 0 interrupted iterations
default   [  49% ] 160 VUs  14.7s/30s

running (0m16.0s), 160/160 VUs, 85 complete and 0 interrupted iterations
default   [  52% ] 160 VUs  15.7s/30s

running (0m17.0s), 160/160 VUs, 160 complete and 0 interrupted iterations
default   [  56% ] 160 VUs  16.7s/30s

running (0m18.0s), 160/160 VUs, 160 complete and 0 interrupted iterations
default   [  59% ] 160 VUs  17.7s/30s

running (0m19.0s), 160/160 VUs, 160 complete and 0 interrupted iterations
default   [  62% ] 160 VUs  18.7s/30s

running (0m20.0s), 160/160 VUs, 160 complete and 0 interrupted iterations
default   [  66% ] 160 VUs  19.7s/30s

running (0m21.0s), 160/160 VUs, 161 complete and 0 interrupted iterations
default   [  69% ] 160 VUs  20.7s/30s

running (0m22.0s), 160/160 VUs, 168 complete and 0 interrupted iterations
default   [  72% ] 160 VUs  21.7s/30s

running (0m23.0s), 160/160 VUs, 175 complete and 0 interrupted iterations
default   [  76% ] 160 VUs  22.7s/30s

running (0m24.0s), 160/160 VUs, 223 complete and 0 interrupted iterations
default   [  79% ] 160 VUs  23.7s/30s

running (0m25.0s), 160/160 VUs, 249 complete and 0 interrupted iterations
default   [  82% ] 160 VUs  24.7s/30s

running (0m26.0s), 160/160 VUs, 320 complete and 0 interrupted iterations
default   [  86% ] 160 VUs  25.7s/30s

running (0m27.0s), 160/160 VUs, 321 complete and 0 interrupted iterations
default   [  89% ] 160 VUs  26.7s/30s

running (0m28.0s), 160/160 VUs, 321 complete and 0 interrupted iterations
default   [  92% ] 160 VUs  27.7s/30s

running (0m29.0s), 160/160 VUs, 334 complete and 0 interrupted iterations
default   [  96% ] 160 VUs  28.7s/30s

running (0m30.0s), 160/160 VUs, 342 complete and 0 interrupted iterations
default   [  99% ] 160 VUs  29.7s/30s

running (0m31.0s), 146/160 VUs, 364 complete and 0 interrupted iterations
default ↓ [ 100% ] 160 VUs  30s

running (0m32.0s), 095/160 VUs, 415 complete and 0 interrupted iterations
default ↓ [ 100% ] 160 VUs  30s

running (0m33.0s), 030/160 VUs, 480 complete and 0 interrupted iterations
default ↓ [ 100% ] 160 VUs  30s

running (0m34.0s), 029/160 VUs, 481 complete and 0 interrupted iterations
default ↓ [ 100% ] 160 VUs  30s

running (0m35.0s), 016/160 VUs, 494 complete and 0 interrupted iterations
default ↓ [ 100% ] 160 VUs  30s

running (0m36.0s), 013/160 VUs, 497 complete and 0 interrupted iterations
default ↓ [ 100% ] 160 VUs  30s


  █ THRESHOLDS 

    create_shipment_duration
    ✓ 'p(95)<1000' p(95)=221.83975

    dashboard_duration
    ✗ 'p(95)<1000' p(95)=3309.3367

    http_req_duration
    ✗ 'p(95)<1000' p(95)=3.91s
    ✗ 'p(99)<2000' p(99)=7.17s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    login_duration
    ✗ 'p(95)<1000' p(95)=7413.294

    search_duration
    ✓ 'p(95)<1000' p(95)=750.01715


  █ TOTAL RESULTS 

    checks_total.......: 3221    88.115513/s
    checks_succeeded...: 100.00% 3221 out of 3221
    checks_failed......: 0.00%   0 out of 3221

    ✓ login 200
    ✓ dashboard 200
    ✓ search 200
    ✓ open shipment 200
    ✓ track 200
    ✓ create shipment 201/200
    ✓ update shipment 200

    CUSTOM
    create_shipment_duration.......: avg=69.7916     min=6.782   med=28.24     max=409.55   p(90)=190.6552  p(95)=221.83975
    dashboard_duration.............: avg=1694.337027 min=52.654  med=1599.1775 max=6680.712 p(90)=2794.4355 p(95)=3309.3367
    login_duration.................: avg=6219.577242 min=286.277 med=6755.208  max=8034.097 p(90)=7369.865  p(95)=7413.294 
    search_duration................: avg=285.813433  min=13.903  med=288.119   max=1202.977 p(90)=602.1223  p(95)=750.01715

    HTTP
    http_req_duration..............: avg=653.8ms     min=2.61ms  med=41.4ms    max=8.03s    p(90)=2.18s     p(95)=3.91s    
      { expected_response:true }...: avg=653.8ms     min=2.61ms  med=41.4ms    max=8.03s    p(90)=2.18s     p(95)=3.91s    
    http_req_failed................: 0.00%  0 out of 3225
    http_reqs......................: 3225   88.224939/s

    EXECUTION
    iteration_duration.............: avg=10.13s      min=6.14s   med=8.3s      max=16.19s   p(90)=16.05s    p(95)=16.13s   
    iterations.....................: 510    13.951851/s
    vus............................: 13     min=13        max=160
    vus_max........................: 160    min=160       max=160

    NETWORK
    data_received..................: 14 MB  386 kB/s
    data_sent......................: 2.8 MB 76 kB/s



running (0m36.6s), 000/160 VUs, 510 complete and 0 interrupted iterations
default ✓ [ 100% ] 160 VUs  30s
time="2026-08-17T14:25:40+05:30" level=error msg="thresholds on metrics 'dashboard_duration, http_req_duration, login_duration' have been crossed"